var data =
/******/ (function(modules) { // webpackBootstrap
/******/ 	// The module cache
/******/ 	var installedModules = {};
/******/
/******/ 	// The require function
/******/ 	function __webpack_require__(moduleId) {
/******/
/******/ 		// Check if module is in cache
/******/ 		if(installedModules[moduleId]) {
/******/ 			return installedModules[moduleId].exports;
/******/ 		}
/******/ 		// Create a new module (and put it into the cache)
/******/ 		var module = installedModules[moduleId] = {
/******/ 			i: moduleId,
/******/ 			l: false,
/******/ 			exports: {}
/******/ 		};
/******/
/******/ 		// Execute the module function
/******/ 		modules[moduleId].call(module.exports, module, module.exports, __webpack_require__);
/******/
/******/ 		// Flag the module as loaded
/******/ 		module.l = true;
/******/
/******/ 		// Return the exports of the module
/******/ 		return module.exports;
/******/ 	}
/******/
/******/
/******/ 	// expose the modules object (__webpack_modules__)
/******/ 	__webpack_require__.m = modules;
/******/
/******/ 	// expose the module cache
/******/ 	__webpack_require__.c = installedModules;
/******/
/******/ 	// define getter function for harmony exports
/******/ 	__webpack_require__.d = function(exports, name, getter) {
/******/ 		if(!__webpack_require__.o(exports, name)) {
/******/ 			Object.defineProperty(exports, name, { enumerable: true, get: getter });
/******/ 		}
/******/ 	};
/******/
/******/ 	// define __esModule on exports
/******/ 	__webpack_require__.r = function(exports) {
/******/ 		if(typeof Symbol !== 'undefined' && Symbol.toStringTag) {
/******/ 			Object.defineProperty(exports, Symbol.toStringTag, { value: 'Module' });
/******/ 		}
/******/ 		Object.defineProperty(exports, '__esModule', { value: true });
/******/ 	};
/******/
/******/ 	// create a fake namespace object
/******/ 	// mode & 1: value is a module id, require it
/******/ 	// mode & 2: merge all properties of value into the ns
/******/ 	// mode & 4: return value when already ns object
/******/ 	// mode & 8|1: behave like require
/******/ 	__webpack_require__.t = function(value, mode) {
/******/ 		if(mode & 1) value = __webpack_require__(value);
/******/ 		if(mode & 8) return value;
/******/ 		if((mode & 4) && typeof value === 'object' && value && value.__esModule) return value;
/******/ 		var ns = Object.create(null);
/******/ 		__webpack_require__.r(ns);
/******/ 		Object.defineProperty(ns, 'default', { enumerable: true, value: value });
/******/ 		if(mode & 2 && typeof value != 'string') for(var key in value) __webpack_require__.d(ns, key, function(key) { return value[key]; }.bind(null, key));
/******/ 		return ns;
/******/ 	};
/******/
/******/ 	// getDefaultExport function for compatibility with non-harmony modules
/******/ 	__webpack_require__.n = function(module) {
/******/ 		var getter = module && module.__esModule ?
/******/ 			function getDefault() { return module['default']; } :
/******/ 			function getModuleExports() { return module; };
/******/ 		__webpack_require__.d(getter, 'a', getter);
/******/ 		return getter;
/******/ 	};
/******/
/******/ 	// Object.prototype.hasOwnProperty.call
/******/ 	__webpack_require__.o = function(object, property) { return Object.prototype.hasOwnProperty.call(object, property); };
/******/
/******/ 	// __webpack_public_path__
/******/ 	__webpack_require__.p = "";
/******/
/******/
/******/ 	// Load entry module and return exports
/******/ 	return __webpack_require__(__webpack_require__.s = "./src/data.js");
/******/ })
/************************************************************************/
/******/ ({

/***/ "./src/data.js":
/*!*********************!*\
  !*** ./src/data.js ***!
  \*********************/
/*! exports provided: default */
/***/ (function(module, __webpack_exports__, __webpack_require__) {

"use strict";
eval("__webpack_require__.r(__webpack_exports__);\n/* harmony default export */ __webpack_exports__[\"default\"] = ({\n\n    // 縣市\n    counties: [\n        '台北市', '基隆市', '新北市', '宜蘭縣', '桃園市', '新竹市', '新竹縣', '苗栗縣',\n        '台中市', '彰化縣', '南投縣', '嘉義市', '嘉義縣', '雲林縣', '台南市', '高雄市',\n        '澎湖縣', '金門縣', '屏東縣', '台東縣', '花蓮縣', '連江縣'\n    ],\n\n    // 區域\n    districts: [\n        // 台北市\n        [\n            ['中正區', '大同區', '中山區', '松山區', '大安區', '萬華區', '信義區',\n            '士林區', '北投區', '內湖區', '南港區', '文山區'],\n\n            ['100', '103', '104', '105', '106', '108', '110', '111', '112', '114', '115', '116']\n        ],\n        // 基隆市\n        [\n            ['仁愛區', '信義區', '中正區', '中山區', '安樂區', '暖暖區', '七堵區'],\n\n            ['200', '201', '202', '203', '204', '205', '206']\n        ],\n        // 新北市\n        [\n            ['萬里區', '金山區', '板橋區', '汐止區', '深坑區', '石碇區', '瑞芳區', '平溪區',\n            '雙溪區', '貢寮區', '新店區', '坪林區', '烏來區', '永和區', '中和區', '土城區',\n            '三峽區', '樹林區', '鶯歌區', '三重區', '新莊區', '泰山區', '林口區', '蘆洲區',\n            '五股區', '八里區', '淡水區', '三芝區', '石門區'],\n\n            ['207', '208', '220', '221', '222', '223', '224', '226', '227', '228',\n            '231', '232', '233', '234', '235', '236', '237', '238', '239', '241',\n            '242', '243', '244', '247', '248', '249', '251', '252', '253']\n        ],\n        // 宜蘭縣\n        [\n            ['宜蘭市', '頭城鎮', '礁溪鄉', '壯圍鄉', '員山鄉', '羅東鎮', '三星鄉', '大同鄉',\n            '五結鄉', '冬山鄉', '蘇澳鎮', '南澳鄉', '釣魚台列嶼'],\n\n            ['260', '261', '262', '263', '264', '265', '266', '267', '268', '269',\n            '270', '272', '290']\n        ],\n        // 桃園市\n    \t[\n    \t\t['中壢區', '平鎮區', '龍潭區', '楊梅區', '新屋區', '觀音區', '桃園區', '龜山區',\n    \t\t'八德區', '大溪區', '復興區', '大園區', '蘆竹區'],\n\n    \t\t['320', '324', '325', '326', '327', '328', '330', '333', '334', '335',\n    \t\t'336', '337', '338']\n        ],\n        // 新竹市\n        [\n            ['東區', '北區', '香山區'],\n\n            ['300', '300', '300']\n        ],\n        // 新竹縣\n        [\n            ['竹北市', '湖口鄉', '新豐鄉', '新埔鎮', '關西鎮', '芎林鄉', '寶山鄉',\n            '竹東鎮', '五峰鄉', '橫山鄉', '尖石鄉', '北埔鄉', '峨眉鄉'],\n\n            ['302', '303', '304', '305', '306', '307', '308', '310', '311',\n            '312', '313', '314', '315']\n        ],\n        // 苗栗縣\n        [\n            ['竹南鎮', '頭份市', '三灣鄉', '南庄鄉', '獅潭鄉', '後龍鎮', '通霄鎮', '苑裡鎮',\n            '苗栗市', '造橋鄉', '頭屋鄉', '公館鄉', '大湖鄉', '泰安鄉',\n            '銅鑼鄉', '三義鄉', '西湖鄉', '卓蘭鎮'],\n\n            ['350', '351', '352', '353', '354', '356', '357', '358', '360', '361',\n            '362', '363', '364', '365', '366', '367', '368', '369']\n        ],\n        // 台中市\n        [\n            ['中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區',\n            '大里區', '霧峰區', '烏日區', '豐原區', '后里區', '石岡區', '東勢區', '和平區',\n            '新社區', '潭子區', '大雅區', '神岡區', '大肚區', '沙鹿區', '龍井區', '梧棲區',\n            '清水區', '大甲區', '外埔區', '大安區'],\n\n            ['400', '401', '402', '403', '404', '406', '407', '408', '411', '412',\n            '413', '414', '420', '421', '422', '423', '424', '426', '427', '428',\n            '429', '432', '433', '434', '435', '436', '437', '438', '439']\n        ],\n        // 彰化縣\n        [\n            ['彰化市', '芬園鄉', '花壇鄉', '秀水鄉', '鹿港鎮', '福興鄉', '線西鄉', '和美鎮',\n            '伸港鄉', '員林市', '社頭鄉', '永靖鄉', '埔心鄉', '溪湖鎮', '大村鄉', '埔鹽鄉',\n            '田中鎮', '北斗鎮', '田尾鄉', '埤頭鄉', '溪州鄉', '竹塘鄉', '二林鎮', '大城鄉',\n            '芳苑鄉', '二水鄉'],\n\n            ['500', '502', '503', '504', '505', '506', '507', '508', '509', '510',\n            '511', '512', '513', '514', '515', '516', '520', '521', '522', '523',\n            '524', '525', '526', '527', '528', '530']\n        ],\n        // 南投縣\n        [\n            ['南投市', '中寮鄉', '草屯鎮', '國姓鄉', '埔里鎮', '仁愛鄉', '名間鄉', '集集鎮',\n            '水里鄉', '魚池鄉', '信義鄉', '竹山鎮', '鹿谷鄉'],\n\n            ['540', '541', '542', '544', '545', '546', '551', '552', '553', '555',\n            '556', '557', '558']\n        ],\n        // 嘉義市\n        [\n            ['東區', '西區'],\n\n            ['600', '600']\n        ],\n        // 嘉義縣\n        [\n            ['番路鄉', '梅山鄉', '竹崎鄉', '阿里山', '中埔鄉', '大埔鄉', '水上鄉',\n            '鹿草鄉', '太保市', '朴子市', '東石鄉', '六腳鄉', '新港鄉', '民雄鄉', '大林鎮',\n            '溪口鄉', '義竹鄉', '布袋鎮'],\n\n            ['602', '603', '604', '605', '606', '607', '608', '611', '612',\n            '613', '614', '615', '616', '621', '622', '623', '624', '625']\n        ],\n        // 雲林縣\n        [\n            ['斗南鎮', '大埤鄉', '虎尾鎮', '土庫鎮', '褒忠鄉', '東勢鄉', '台西鄉', '崙背鄉',\n            '麥寮鄉', '斗六市', '林內鄉', '古坑鄉', '莿桐鄉', '西螺鎮', '二崙鄉', '北港鎮',\n            '水林鄉', '口湖鄉', '四湖鄉', '元長鄉'],\n\n            ['630', '631', '632', '633', '634', '635', '636', '637', '638', '640', '643',\n            '646', '647', '648', '649', '651', '652', '653', '654', '655']\n        ],\n        // 台南市\n        [\n            ['中西區', '東區', '南區', '北區', '安平區', '安南區', '永康區', '歸仁區', '新化區',\n            '左鎮區', '玉井區', '楠西區', '南化區', '仁德區', '關廟區', '龍崎區', '官田區',\n            '麻豆區', '佳里區', '西港區', '七股區', '將軍區', '學甲區', '北門區', '新營區',\n            '後壁區', '白河區', '東山區', '六甲區', '下營區', '柳營區', '鹽水區', '善化區',\n            '大內區', '山上區', '新市區', '安定區'],\n\n            ['700', '701', '702', '704', '708', '709', '710', '711', '712', '713', '714',\n            '715', '716', '717', '718', '719', '720', '721', '722', '723', '724', '725',\n            '726', '727', '730', '731', '732', '733', '734', '735', '736', '737', '741',\n            '742', '743', '744', '745']\n        ],\n        // 高雄市\n        [\n            ['新興區', '前金區', '苓雅區', '鹽埕區', '鼓山區', '旗津區', '前鎮區', '三民區',\n            '楠梓區', '小港區', '左營區', '仁武區', '大社區', '東沙群島', '南沙群島', '岡山區',\n            '路竹區', '阿蓮區', '田寮區', '燕巢區', '橋頭區', '梓官區', '彌陀區', '永安區',\n            '湖內區', '鳳山區', '大寮區', '林園區', '鳥松區', '大樹區', '旗山區', '美濃區',\n            '六龜區', '內門區', '杉林區', '甲仙區', '桃源區', '那瑪夏區', '茂林區', '茄萣區'],\n\n            ['800', '801', '802', '803', '804', '805', '806', '807', '811', '812', '813',\n            '814', '815', '817', '819', '820', '821', '822', '823', '824', '825', '826', '827', '828',\n            '829', '830', '831', '832', '833', '840', '842', '843', '844', '845', '846',\n            '847', '848', '849', '851', '852']\n        ],\n        // 澎湖縣\n        [\n            ['馬公市', '西嶼鄉', '望安鄉', '七美鄉', '白沙鄉', '湖西鄉'],\n\n            ['880', '881', '882', '883', '884', '885']\n        ],\n        // 金門縣\n        [\n            ['金沙鎮', '金湖鎮', '金寧鄉', '金城鎮', '烈嶼鄉', '烏坵鄉'],\n\n            ['890', '891', '892', '893', '894', '896']\n        ],\n        // 屏東縣\n        [\n            ['屏東市', '三地門鄉', '霧台鄉', '瑪家鄉', '九如鄉', '里港鄉', '高樹鄉', '鹽埔鄉',\n            '長治鄉', '麟洛鄉', '竹田鄉', '內埔鄉', '萬丹鄉', '潮州鎮', '泰武鄉', '來義鄉',\n            '萬巒鄉', '崁頂鄉', '新埤鄉', '南州鄉', '林邊鄉', '東港鎮', '琉球鄉', '佳冬鄉',\n            '新園鄉', '枋寮鄉', '枋山鄉', '春日鄉', '獅子鄉', '車城鄉', '牡丹鄉', '恆春鎮',\n            '滿州鄉'],\n\n            ['900', '901', '902', '903', '904', '905', '906', '907', '908', '909', '911',\n            '912', '913', '920', '921', '922', '923', '924', '925', '926', '927', '928',\n            '929', '931', '932', '940', '941', '942', '943', '944', '945', '946', '947']\n        ],\n        // 台東縣\n        [\n            ['台東市', '綠島鄉', '蘭嶼鄉', '延平鄉', '卑南鄉', '鹿野鄉', '關山鎮', '海端鄉',\n            '池上鄉', '東河鄉', '成功鎮', '長濱鄉', '太麻里', '金峰鄉', '大武鄉', '達仁鄉'],\n\n            ['950', '951', '952', '953', '954', '955', '956', '957', '958', '959', '961',\n            '962', '963', '964', '965', '966']\n        ],\n        // 花蓮縣\n        [\n            ['花蓮市', '新城鄉', '秀林鄉', '吉安鄉', '壽豐鄉', '鳳林鎮', '光復鄉', '豐濱鄉',\n            '瑞穗鄉', '萬榮鄉', '玉里鎮', '卓溪鄉', '富里鄉'],\n\n            ['970', '971', '972', '973', '974', '975', '976', '977', '978', '979', '981',\n            '982', '983']\n        ],\n        // 連江縣\n        [\n            ['南竿鄉', '北竿鄉', '莒光鄉', '東引鄉'],\n\n            ['209', '210', '211', '212']\n        ]\n    ]\n});\n\n\n//# sourceURL=webpack://data/./src/data.js?");

/***/ })

/******/ })["default"];